using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace ControlDantist.Find
{
    public class QueryPersonBefor2019_a : IFindPerson
    {
        private int id = 0;

        public QueryPersonBefor2019_a(int id)
        {
            this.id = id;
        }

        public string Query()
        {
            return "SELECT top 1 ДоговорАрхив.НомерДоговора, ДоговорАрхив.ДатаДоговора, ЛьготникАрхив.Фамилия, ЛьготникАрхив.Имя, ЛьготникАрхив.Отчество, " +
                                           "ЛьготникАрхив.ДатаРождения, ЛьготникАрхив.улица, ЛьготникАрхив.НомерДома, ЛьготникАрхив.корпус, ЛьготникАрхив.НомерКвартиры, " +
                                           "ЛьготникАрхив.СерияПаспорта, ЛьготникАрхив.НомерПаспорта, ЛьготникАрхив.СерияДокумента, ЛьготникАрхив.НомерДокумента, " +
                                           "ЛьготникАрхив.ДатаВыдачиДокумента, ЛьготникАрхив.ДатаВыдачиПаспорта,ДоговорАрхив.ФлагПроверки " +
                                           "FROM ДоговорАрхив INNER JOIN " +
                                           "УслугиПоДоговоруАрхив ON ДоговорАрхив.id_договор = УслугиПоДоговоруАрхив.id_договор " +
                                           "INNER JOIN ЛьготникАрхив ON dbo.ДоговорАрхив.id_льготник = dbo.ЛьготникАрхив.id_льготник " +
                                           "where ДоговорАрхив.id_договор = " + this.id + " ";
        }
    }
}
